# ETL

## Import

In [1]:
import pandas as pd

## Extract

In [2]:
data = pd.read_csv("./data/data.csv")

vgsales = pd.read_csv("./data/vgsales.csv")
vgsales.rename(columns={"Year":"Year_of_Release"},inplace=True)

## Transform

### Common data

In [3]:
# donnees en communs
common_data = pd.merge(data,vgsales,how="inner",on=["Name","Platform","Publisher","Genre","Year_of_Release"])

common_data = pd.melt(common_data, 
        id_vars=common_data.columns.tolist()[:-5], 
        value_vars=common_data.columns.tolist()[-5:], 
        var_name='Localisation', 
        value_name='Ventes',
        ignore_index=False)

print(common_data.shape)

common_data.rename(columns={
        "Critic_Score" : "mean_score_critic",
        "User_Score" : "mean_score_user",
        "Year_of_Release" : "year",
        "Localisation" : "area",
        "Name" : "name_product",
        "Game_Id" : "id_product",
        "Ventes" : "sales"
},inplace=True)

common_data['area'] = common_data['area'].str.rstrip('_Sales')

common_data.head()

(82415, 14)

,id_product,name_product,Platform,year,Genre,Publisher,mean_score_critic,Critic_Count,mean_score_user,Developer,Rating,Rank,area,sales
0,49167,Wii Sports,Wii,2006.0,Sports,Nintendo,76,51,8.0,Nintendo,E,1,NA,41.49
1,52840,Super Mario Bros.,NES,1985.0,Platform,Nintendo,72,24,7.5,Big Red Button Entertainment,T,2,NA,29.08
2,93224,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,82,73,8.3,Nintendo,E,3,NA,15.85
3,33629,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,80,73,8.0,Nintendo,E,4,NA,15.75
4,86706,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,72,24,7.5,Takara,E,5,NA,11.27

### Dimension Temps

In [4]:
dim_temps = common_data.drop_duplicates("year")[["year"]].reset_index()
dim_temps["id_temps"] = dim_temps.index + 1
dim_temps = dim_temps[["id_temps","year"]]
print(dim_temps.shape)
dim_temps.head()

(40, 2)

   id_temps    year
0         1  2006.0
1         2  1985.0
2         3  2008.0
3         4  2009.0
4         5  1996.0

### Dimension Localisation

In [5]:
dim_localisation = common_data.drop_duplicates("area")[["area"]].reset_index()
dim_localisation["id_localisation"] = dim_localisation.index + 1
dim_localisation = dim_localisation[["id_localisation","area"]]
print(dim_localisation.shape)
dim_localisation.head()

(5, 2)

   id_localisation   area
0                1     NA
1                2     EU
2                3     JP
3                4  Other
4                5   Glob

### Dimension Produit

In [6]:
dim_produit = common_data.drop_duplicates("id_product")[["id_product","name_product"]]
print(dim_produit.shape)
dim_produit.head()

(16480, 2)

   id_product              name_product
0       49167                Wii Sports
1       52840         Super Mario Bros.
2       93224            Mario Kart Wii
3       33629         Wii Sports Resort
4       86706  Pokemon Red/Pokemon Blue

### Table de fait

In [7]:
fact_table = common_data.merge(dim_produit,how="inner",on=["id_product","name_product"]).drop(columns=["name_product"])
fact_table = fact_table.merge(dim_localisation,how="inner",on=["area"]).drop(columns=["area"])
fact_table = fact_table.merge(dim_temps,how="inner",on=["year"]).drop(columns=["year"])

fact_cols = ["id_product","id_localisation","id_temps","sales","mean_score_critic","mean_score_user"]
fact_table = fact_table[fact_cols]

print(fact_table.shape)
fact_table.head()

(82415, 6)

,id_product,id_localisation,id_temps,sales,mean_score_critic,mean_score_user
0,49167,1,1,41.49,76,8.0
1,73907,1,1,11.38,89,8.5
2,33576,1,1,14.03,58,6.6
3,54312,1,1,6.42,72,7.5
4,70689,1,1,3.83,95,9.0

In [8]:
fact_table.to_csv("fact_table.csv")

## Load

https://www.analyticsvidhya.com/blog/2021/06/how-to-build-a-data-warehouse-using-postgresql-in-python/

https://www.geeksforgeeks.org/how-to-write-pandas-dataframe-to-postgresql-table/

In [34]:
from sqlalchemy import create_engine

import psycopg2
import pandas as pd

In [35]:
conn_string = 'postgresql://postgres:Joshua159951@localhost:5432/test'

In [36]:
db = create_engine(conn_string)
conn = db.connect()

In [37]:
conn1 = psycopg2.connect(
    database="test",
    user='postgres', 
    password='Joshua159951', 
    host='127.0.0.1', 
    port= '5432'
)

In [38]:
conn1.autocommit = True
cursor = conn1.cursor()

In [39]:
cursor.execute('drop table if exists dim_localisation')

sql = '''
CREATE TABLE dim_localisation(id_localisation int ,
                              area char(20));
'''
  
cursor.execute(sql)

In [40]:
dim_localisation.to_sql('dim_localisation', conn, if_exists= 'replace')

In [44]:
sql1= '''
select * from dim_localisation;
'''
cursor.execute(sql1)
res = cursor.fetchall()

print(res)

[(0, 1, 'NA'), (1, 2, 'EU'), (2, 3, 'JP'), (3, 4, 'Other'), (4, 5, 'Glob')]

In [ ]:
conn1.commit()
conn1.close()